FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_rtc.h
/**
 * \file
 *
 * \brief Component description for RTC
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_RTC_COMPONENT_
#define _SAMD20_RTC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR RTC */
/* ========================================================================== */
/** \addtogroup SAMD20_RTC Real-Time Counter */
/*@{*/

#define REV_RTC    0x101

/* -------- RTC_MODE0_CTRL : (RTC Offset: 0x00) (R/W 16) MODE0 MODE0 Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t SWRST : 1;     /*!< bit:      0  Software Reset                     */
            uint16_t ENABLE : 1;    /*!< bit:      1  Enable                             */
            uint16_t MODE : 2;      /*!< bit:  2.. 3  Mode                               */
            uint16_t : 3;           /*!< bit:  4.. 6  Reserved                           */
            uint16_t MATCHCLR : 1;  /*!< bit:      7  Match Clears Counter               */
            uint16_t PRESCALER : 4; /*!< bit:  8..11  Prescaler                          */
            uint16_t : 4;           /*!< bit: 12..15  Reserved                           */
        } bit;                      /*!< Structure used for bit  access                  */
        uint16_t reg;               /*!< Type      used for register access              */
    } RTC_MODE0_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE0_CTRL_OFFSET                 0x00   /**< \brief (RTC_MODE0_CTRL offset) MODE0 Control Register */
#define RTC_MODE0_CTRL_RESETVALUE             0x0000 /**< \brief (RTC_MODE0_CTRL reset_value) MODE0 Control Register */

#define RTC_MODE0_CTRL_SWRST_Pos              0      /**< \brief (RTC_MODE0_CTRL) Software Reset */
#define RTC_MODE0_CTRL_SWRST                  ( 0x1u << RTC_MODE0_CTRL_SWRST_Pos )
#define RTC_MODE0_CTRL_ENABLE_Pos             1      /**< \brief (RTC_MODE0_CTRL) Enable */
#define RTC_MODE0_CTRL_ENABLE                 ( 0x1u << RTC_MODE0_CTRL_ENABLE_Pos )
#define RTC_MODE0_CTRL_MODE_Pos               2      /**< \brief (RTC_MODE0_CTRL) Mode */
#define RTC_MODE0_CTRL_MODE_Msk               ( 0x3u << RTC_MODE0_CTRL_MODE_Pos )
#define RTC_MODE0_CTRL_MODE( value )    ( ( RTC_MODE0_CTRL_MODE_Msk & ( ( value ) << RTC_MODE0_CTRL_MODE_Pos ) ) )
#define   RTC_MODE0_CTRL_MODE_COUNT32         ( 0x0u << 2 ) /**< \brief (RTC_MODE0_CTRL) Mode 0 */
#define   RTC_MODE0_CTRL_MODE_COUNT16         ( 0x1u << 2 ) /**< \brief (RTC_MODE0_CTRL) Mode 1 */
#define   RTC_MODE0_CTRL_MODE_CLOCK           ( 0x2u << 2 ) /**< \brief (RTC_MODE0_CTRL) Mode 2 */
#define RTC_MODE0_CTRL_MATCHCLR_Pos           7             /**< \brief (RTC_MODE0_CTRL) Match Clears Counter */
#define RTC_MODE0_CTRL_MATCHCLR               ( 0x1u << RTC_MODE0_CTRL_MATCHCLR_Pos )
#define RTC_MODE0_CTRL_PRESCALER_Pos          8             /**< \brief (RTC_MODE0_CTRL) Prescaler */
#define RTC_MODE0_CTRL_PRESCALER_Msk          ( 0xFu << RTC_MODE0_CTRL_PRESCALER_Pos )
#define RTC_MODE0_CTRL_PRESCALER( value )    ( ( RTC_MODE0_CTRL_PRESCALER_Msk & ( ( value ) << RTC_MODE0_CTRL_PRESCALER_Pos ) ) )
#define   RTC_MODE0_CTRL_PRESCALER_DIV1       ( 0x0u << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define   RTC_MODE0_CTRL_PRESCALER_DIV2       ( 0x1u << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define   RTC_MODE0_CTRL_PRESCALER_DIV4       ( 0x2u << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define   RTC_MODE0_CTRL_PRESCALER_DIV8       ( 0x3u << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define   RTC_MODE0_CTRL_PRESCALER_DIV16      ( 0x4u << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define   RTC_MODE0_CTRL_PRESCALER_DIV32      ( 0x5u << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define   RTC_MODE0_CTRL_PRESCALER_DIV64      ( 0x6u << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define   RTC_MODE0_CTRL_PRESCALER_DIV128     ( 0x7u << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define   RTC_MODE0_CTRL_PRESCALER_DIV256     ( 0x8u << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define   RTC_MODE0_CTRL_PRESCALER_DIV512     ( 0x9u << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define   RTC_MODE0_CTRL_PRESCALER_DIV1024    ( 0xAu << 8 ) /**< \brief (RTC_MODE0_CTRL)  */
#define RTC_MODE0_CTRL_MASK                   0x0F8Fu       /**< \brief (RTC_MODE0_CTRL) MASK Register */

