FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_rtc.h
/* -------- RTC_MODE1_CTRL : (RTC Offset: 0x00) (R/W 16) MODE1 MODE1 Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t SWRST : 1;     /*!< bit:      0  Software Reset                     */
            uint16_t ENABLE : 1;    /*!< bit:      1  Enable                             */
            uint16_t MODE : 2;      /*!< bit:  2.. 3  Mode                               */
            uint16_t : 4;           /*!< bit:  4.. 7  Reserved                           */
            uint16_t PRESCALER : 4; /*!< bit:  8..11  Prescaler                          */
            uint16_t : 4;           /*!< bit: 12..15  Reserved                           */
        } bit;                      /*!< Structure used for bit  access                  */
        uint16_t reg;               /*!< Type      used for register access              */
    } RTC_MODE1_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE1_CTRL_OFFSET                 0x00   /**< \brief (RTC_MODE1_CTRL offset) MODE1 Control Register */
#define RTC_MODE1_CTRL_RESETVALUE             0x0000 /**< \brief (RTC_MODE1_CTRL reset_value) MODE1 Control Register */

#define RTC_MODE1_CTRL_SWRST_Pos              0      /**< \brief (RTC_MODE1_CTRL) Software Reset */
#define RTC_MODE1_CTRL_SWRST                  ( 0x1u << RTC_MODE1_CTRL_SWRST_Pos )
#define RTC_MODE1_CTRL_ENABLE_Pos             1      /**< \brief (RTC_MODE1_CTRL) Enable */
#define RTC_MODE1_CTRL_ENABLE                 ( 0x1u << RTC_MODE1_CTRL_ENABLE_Pos )
#define RTC_MODE1_CTRL_MODE_Pos               2      /**< \brief (RTC_MODE1_CTRL) Mode */
#define RTC_MODE1_CTRL_MODE_Msk               ( 0x3u << RTC_MODE1_CTRL_MODE_Pos )
#define RTC_MODE1_CTRL_MODE( value )    ( ( RTC_MODE1_CTRL_MODE_Msk & ( ( value ) << RTC_MODE1_CTRL_MODE_Pos ) ) )
#define   RTC_MODE1_CTRL_MODE_COUNT32         ( 0x0u << 2 ) /**< \brief (RTC_MODE1_CTRL) Mode 0 */
#define   RTC_MODE1_CTRL_MODE_COUNT16         ( 0x1u << 2 ) /**< \brief (RTC_MODE1_CTRL) Mode 1 */
#define   RTC_MODE1_CTRL_MODE_CLOCK           ( 0x2u << 2 ) /**< \brief (RTC_MODE1_CTRL) Mode 2 */
#define RTC_MODE1_CTRL_PRESCALER_Pos          8             /**< \brief (RTC_MODE1_CTRL) Prescaler */
#define RTC_MODE1_CTRL_PRESCALER_Msk          ( 0xFu << RTC_MODE1_CTRL_PRESCALER_Pos )
#define RTC_MODE1_CTRL_PRESCALER( value )    ( ( RTC_MODE1_CTRL_PRESCALER_Msk & ( ( value ) << RTC_MODE1_CTRL_PRESCALER_Pos ) ) )
#define   RTC_MODE1_CTRL_PRESCALER_DIV1       ( 0x0u << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define   RTC_MODE1_CTRL_PRESCALER_DIV2       ( 0x1u << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define   RTC_MODE1_CTRL_PRESCALER_DIV4       ( 0x2u << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define   RTC_MODE1_CTRL_PRESCALER_DIV8       ( 0x3u << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define   RTC_MODE1_CTRL_PRESCALER_DIV16      ( 0x4u << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define   RTC_MODE1_CTRL_PRESCALER_DIV32      ( 0x5u << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define   RTC_MODE1_CTRL_PRESCALER_DIV64      ( 0x6u << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define   RTC_MODE1_CTRL_PRESCALER_DIV128     ( 0x7u << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define   RTC_MODE1_CTRL_PRESCALER_DIV256     ( 0x8u << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define   RTC_MODE1_CTRL_PRESCALER_DIV512     ( 0x9u << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define   RTC_MODE1_CTRL_PRESCALER_DIV1024    ( 0xAu << 8 ) /**< \brief (RTC_MODE1_CTRL)  */
#define RTC_MODE1_CTRL_MASK                   0x0F0Fu       /**< \brief (RTC_MODE1_CTRL) MASK Register */

/* -------- RTC_MODE2_CTRL : (RTC Offset: 0x00) (R/W 16) MODE2 MODE2 Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t SWRST : 1;     /*!< bit:      0  Software Reset                     */
            uint16_t ENABLE : 1;    /*!< bit:      1  Enable                             */
            uint16_t MODE : 2;      /*!< bit:  2.. 3  Mode                               */
            uint16_t : 2;           /*!< bit:  4.. 5  Reserved                           */
            uint16_t CLKREP : 1;    /*!< bit:      6  Clock Representation               */
            uint16_t MATCHCLR : 1;  /*!< bit:      7  Match Clears Counter               */
            uint16_t PRESCALER : 4; /*!< bit:  8..11  Prescaler                          */
            uint16_t : 4;           /*!< bit: 12..15  Reserved                           */
        } bit;                      /*!< Structure used for bit  access                  */
        uint16_t reg;               /*!< Type      used for register access              */
    } RTC_MODE2_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE2_CTRL_OFFSET                 0x00   /**< \brief (RTC_MODE2_CTRL offset) MODE2 Control Register */
#define RTC_MODE2_CTRL_RESETVALUE             0x0000 /**< \brief (RTC_MODE2_CTRL reset_value) MODE2 Control Register */

#define RTC_MODE2_CTRL_SWRST_Pos              0      /**< \brief (RTC_MODE2_CTRL) Software Reset */
#define RTC_MODE2_CTRL_SWRST                  ( 0x1u << RTC_MODE2_CTRL_SWRST_Pos )
#define RTC_MODE2_CTRL_ENABLE_Pos             1      /**< \brief (RTC_MODE2_CTRL) Enable */
#define RTC_MODE2_CTRL_ENABLE                 ( 0x1u << RTC_MODE2_CTRL_ENABLE_Pos )
#define RTC_MODE2_CTRL_MODE_Pos               2      /**< \brief (RTC_MODE2_CTRL) Mode */
#define RTC_MODE2_CTRL_MODE_Msk               ( 0x3u << RTC_MODE2_CTRL_MODE_Pos )
#define RTC_MODE2_CTRL_MODE( value )    ( ( RTC_MODE2_CTRL_MODE_Msk & ( ( value ) << RTC_MODE2_CTRL_MODE_Pos ) ) )
#define   RTC_MODE2_CTRL_MODE_COUNT32         ( 0x0u << 2 ) /**< \brief (RTC_MODE2_CTRL) Mode 0 */
#define   RTC_MODE2_CTRL_MODE_COUNT16         ( 0x1u << 2 ) /**< \brief (RTC_MODE2_CTRL) Mode 1 */
#define   RTC_MODE2_CTRL_MODE_CLOCK           ( 0x2u << 2 ) /**< \brief (RTC_MODE2_CTRL) Mode 2 */
#define RTC_MODE2_CTRL_CLKREP_Pos             6             /**< \brief (RTC_MODE2_CTRL) Clock Representation */
#define RTC_MODE2_CTRL_CLKREP                 ( 0x1u << RTC_MODE2_CTRL_CLKREP_Pos )
#define RTC_MODE2_CTRL_MATCHCLR_Pos           7             /**< \brief (RTC_MODE2_CTRL) Match Clears Counter */
#define RTC_MODE2_CTRL_MATCHCLR               ( 0x1u << RTC_MODE2_CTRL_MATCHCLR_Pos )
#define RTC_MODE2_CTRL_PRESCALER_Pos          8             /**< \brief (RTC_MODE2_CTRL) Prescaler */
#define RTC_MODE2_CTRL_PRESCALER_Msk          ( 0xFu << RTC_MODE2_CTRL_PRESCALER_Pos )
#define RTC_MODE2_CTRL_PRESCALER( value )    ( ( RTC_MODE2_CTRL_PRESCALER_Msk & ( ( value ) << RTC_MODE2_CTRL_PRESCALER_Pos ) ) )
#define   RTC_MODE2_CTRL_PRESCALER_DIV1       ( 0x0u << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define   RTC_MODE2_CTRL_PRESCALER_DIV2       ( 0x1u << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define   RTC_MODE2_CTRL_PRESCALER_DIV4       ( 0x2u << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define   RTC_MODE2_CTRL_PRESCALER_DIV8       ( 0x3u << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define   RTC_MODE2_CTRL_PRESCALER_DIV16      ( 0x4u << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define   RTC_MODE2_CTRL_PRESCALER_DIV32      ( 0x5u << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define   RTC_MODE2_CTRL_PRESCALER_DIV64      ( 0x6u << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define   RTC_MODE2_CTRL_PRESCALER_DIV128     ( 0x7u << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define   RTC_MODE2_CTRL_PRESCALER_DIV256     ( 0x8u << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define   RTC_MODE2_CTRL_PRESCALER_DIV512     ( 0x9u << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define   RTC_MODE2_CTRL_PRESCALER_DIV1024    ( 0xAu << 8 ) /**< \brief (RTC_MODE2_CTRL)  */
#define RTC_MODE2_CTRL_MASK                   0x0FCFu       /**< \brief (RTC_MODE2_CTRL) MASK Register */

