FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_rtc.h
/* -------- RTC_READREQ : (RTC Offset: 0x02) (R/W 16) Read Request Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t ADDR : 6;  /*!< bit:  0.. 5  Read Address                       */
            uint16_t : 8;       /*!< bit:  6..13  Reserved                           */
            uint16_t RCONT : 1; /*!< bit:     14  Read Continuously                  */
            uint16_t RREQ : 1;  /*!< bit:     15  Read Request                       */
        } bit;                  /*!< Structure used for bit  access                  */
        uint16_t reg;           /*!< Type      used for register access              */
    } RTC_READREQ_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_READREQ_OFFSET        0x02           /**< \brief (RTC_READREQ offset) Read Request Register */
#define RTC_READREQ_RESETVALUE    0x0010         /**< \brief (RTC_READREQ reset_value) Read Request Register */

#define RTC_READREQ_ADDR_Pos      0              /**< \brief (RTC_READREQ) Read Address */
#define RTC_READREQ_ADDR_Msk      ( 0x3Fu << RTC_READREQ_ADDR_Pos )
#define RTC_READREQ_ADDR( value )    ( ( RTC_READREQ_ADDR_Msk & ( ( value ) << RTC_READREQ_ADDR_Pos ) ) )
#define RTC_READREQ_RCONT_Pos     14             /**< \brief (RTC_READREQ) Read Continuously */
#define RTC_READREQ_RCONT         ( 0x1u << RTC_READREQ_RCONT_Pos )
#define RTC_READREQ_RREQ_Pos      15             /**< \brief (RTC_READREQ) Read Request */
#define RTC_READREQ_RREQ          ( 0x1u << RTC_READREQ_RREQ_Pos )
#define RTC_READREQ_MASK          0xC03Fu        /**< \brief (RTC_READREQ) MASK Register */

/* -------- RTC_MODE0_EVCTRL : (RTC Offset: 0x04) (R/W 16) MODE0 MODE0 Event Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t PEREO : 8; /*!< bit:  0.. 7  Periodic Interval Event Output Enables */
            uint16_t CMPEO : 1; /*!< bit:      8  Compare Event Output Enables       */
            uint16_t : 6;       /*!< bit:  9..14  Reserved                           */
            uint16_t OVFEO : 1; /*!< bit:     15  Overflow Event Output Enable       */
        } bit;                  /*!< Structure used for bit  access                  */
        uint16_t reg;           /*!< Type      used for register access              */
    } RTC_MODE0_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE0_EVCTRL_OFFSET        0x04      /**< \brief (RTC_MODE0_EVCTRL offset) MODE0 Event Control Register */
#define RTC_MODE0_EVCTRL_RESETVALUE    0x0000    /**< \brief (RTC_MODE0_EVCTRL reset_value) MODE0 Event Control Register */

#define RTC_MODE0_EVCTRL_PEREO_Pos     0         /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval Event Output Enables */
#define RTC_MODE0_EVCTRL_PEREO_Msk     ( 0xFFu << RTC_MODE0_EVCTRL_PEREO_Pos )
#define RTC_MODE0_EVCTRL_PEREO( value )    ( ( RTC_MODE0_EVCTRL_PEREO_Msk & ( ( value ) << RTC_MODE0_EVCTRL_PEREO_Pos ) ) )
#define RTC_MODE0_EVCTRL_CMPEO_Pos     8         /**< \brief (RTC_MODE0_EVCTRL) Compare Event Output Enables */
#define RTC_MODE0_EVCTRL_CMPEO_Msk     ( 0x1u << RTC_MODE0_EVCTRL_CMPEO_Pos )
#define RTC_MODE0_EVCTRL_CMPEO( value )    ( ( RTC_MODE0_EVCTRL_CMPEO_Msk & ( ( value ) << RTC_MODE0_EVCTRL_CMPEO_Pos ) ) )
#define RTC_MODE0_EVCTRL_OVFEO_Pos     15        /**< \brief (RTC_MODE0_EVCTRL) Overflow Event Output Enable */
#define RTC_MODE0_EVCTRL_OVFEO         ( 0x1u << RTC_MODE0_EVCTRL_OVFEO_Pos )
#define RTC_MODE0_EVCTRL_MASK          0x81FFu   /**< \brief (RTC_MODE0_EVCTRL) MASK Register */

/* -------- RTC_MODE1_EVCTRL : (RTC Offset: 0x04) (R/W 16) MODE1 MODE1 Event Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t PEREO : 8; /*!< bit:  0.. 7  Periodic Interval Event Output Enables */
            uint16_t CMPEO : 2; /*!< bit:  8.. 9  Compare Event Output Enables       */
            uint16_t : 5;       /*!< bit: 10..14  Reserved                           */
            uint16_t OVFEO : 1; /*!< bit:     15  Overflow Event Output Enable       */
        } bit;                  /*!< Structure used for bit  access                  */
        uint16_t reg;           /*!< Type      used for register access              */
    } RTC_MODE1_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE1_EVCTRL_OFFSET        0x04      /**< \brief (RTC_MODE1_EVCTRL offset) MODE1 Event Control Register */
#define RTC_MODE1_EVCTRL_RESETVALUE    0x0000    /**< \brief (RTC_MODE1_EVCTRL reset_value) MODE1 Event Control Register */

#define RTC_MODE1_EVCTRL_PEREO_Pos     0         /**< \brief (RTC_MODE1_EVCTRL) Periodic Interval Event Output Enables */
#define RTC_MODE1_EVCTRL_PEREO_Msk     ( 0xFFu << RTC_MODE1_EVCTRL_PEREO_Pos )
#define RTC_MODE1_EVCTRL_PEREO( value )    ( ( RTC_MODE1_EVCTRL_PEREO_Msk & ( ( value ) << RTC_MODE1_EVCTRL_PEREO_Pos ) ) )
#define RTC_MODE1_EVCTRL_CMPEO_Pos     8         /**< \brief (RTC_MODE1_EVCTRL) Compare Event Output Enables */
#define RTC_MODE1_EVCTRL_CMPEO_Msk     ( 0x3u << RTC_MODE1_EVCTRL_CMPEO_Pos )
#define RTC_MODE1_EVCTRL_CMPEO( value )    ( ( RTC_MODE1_EVCTRL_CMPEO_Msk & ( ( value ) << RTC_MODE1_EVCTRL_CMPEO_Pos ) ) )
#define RTC_MODE1_EVCTRL_OVFEO_Pos     15        /**< \brief (RTC_MODE1_EVCTRL) Overflow Event Output Enable */
#define RTC_MODE1_EVCTRL_OVFEO         ( 0x1u << RTC_MODE1_EVCTRL_OVFEO_Pos )
#define RTC_MODE1_EVCTRL_MASK          0x83FFu   /**< \brief (RTC_MODE1_EVCTRL) MASK Register */

/* -------- RTC_MODE2_EVCTRL : (RTC Offset: 0x04) (R/W 16) MODE2 MODE2 Event Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t PEREO : 8;   /*!< bit:  0.. 7  Periodic Interval Event Output Enables */
            uint16_t ALARMEO : 1; /*!< bit:      8  Alarm 0Event Output Enables        */
            uint16_t : 6;         /*!< bit:  9..14  Reserved                           */
            uint16_t OVFEO : 1;   /*!< bit:     15  Overflow Event Output Enable       */
        } bit;                    /*!< Structure used for bit  access                  */
        uint16_t reg;             /*!< Type      used for register access              */
    } RTC_MODE2_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE2_EVCTRL_OFFSET         0x04     /**< \brief (RTC_MODE2_EVCTRL offset) MODE2 Event Control Register */
#define RTC_MODE2_EVCTRL_RESETVALUE     0x0000   /**< \brief (RTC_MODE2_EVCTRL reset_value) MODE2 Event Control Register */

#define RTC_MODE2_EVCTRL_PEREO_Pos      0        /**< \brief (RTC_MODE2_EVCTRL) Periodic Interval Event Output Enables */
#define RTC_MODE2_EVCTRL_PEREO_Msk      ( 0xFFu << RTC_MODE2_EVCTRL_PEREO_Pos )
#define RTC_MODE2_EVCTRL_PEREO( value )      ( ( RTC_MODE2_EVCTRL_PEREO_Msk & ( ( value ) << RTC_MODE2_EVCTRL_PEREO_Pos ) ) )
#define RTC_MODE2_EVCTRL_ALARMEO_Pos    8         /**< \brief (RTC_MODE2_EVCTRL) Alarm 0Event Output Enables */
#define RTC_MODE2_EVCTRL_ALARMEO_Msk    ( 0x1u << RTC_MODE2_EVCTRL_ALARMEO_Pos )
#define RTC_MODE2_EVCTRL_ALARMEO( value )    ( ( RTC_MODE2_EVCTRL_ALARMEO_Msk & ( ( value ) << RTC_MODE2_EVCTRL_ALARMEO_Pos ) ) )
#define RTC_MODE2_EVCTRL_OVFEO_Pos      15       /**< \brief (RTC_MODE2_EVCTRL) Overflow Event Output Enable */
#define RTC_MODE2_EVCTRL_OVFEO          ( 0x1u << RTC_MODE2_EVCTRL_OVFEO_Pos )
#define RTC_MODE2_EVCTRL_MASK           0x81FFu  /**< \brief (RTC_MODE2_EVCTRL) MASK Register */

