FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_rtc.h
/* -------- RTC_MODE0_INTENCLR : (RTC Offset: 0x06) (R/W  8) MODE0 MODE0 Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CMP : 1;     /*!< bit:      0  Comparator Interrupt Disables      */
            uint8_t  : 5;        /*!< bit:  1.. 5  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      6  Synchronization Ready Interrupt Disable */
            uint8_t OVF : 1;     /*!< bit:      7  Overflow Interrupt Disable         */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } RTC_MODE0_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE0_INTENCLR_OFFSET         0x06   /**< \brief (RTC_MODE0_INTENCLR offset) MODE0 Interrupt Enable Clear Register */
#define RTC_MODE0_INTENCLR_RESETVALUE     0x00   /**< \brief (RTC_MODE0_INTENCLR reset_value) MODE0 Interrupt Enable Clear Register */

#define RTC_MODE0_INTENCLR_CMP_Pos        0      /**< \brief (RTC_MODE0_INTENCLR) Comparator Interrupt Disables */
#define RTC_MODE0_INTENCLR_CMP_Msk        ( 0x1u << RTC_MODE0_INTENCLR_CMP_Pos )
#define RTC_MODE0_INTENCLR_CMP( value )    ( ( RTC_MODE0_INTENCLR_CMP_Msk & ( ( value ) << RTC_MODE0_INTENCLR_CMP_Pos ) ) )
#define RTC_MODE0_INTENCLR_SYNCRDY_Pos    6      /**< \brief (RTC_MODE0_INTENCLR) Synchronization Ready Interrupt Disable */
#define RTC_MODE0_INTENCLR_SYNCRDY        ( 0x1u << RTC_MODE0_INTENCLR_SYNCRDY_Pos )
#define RTC_MODE0_INTENCLR_OVF_Pos        7      /**< \brief (RTC_MODE0_INTENCLR) Overflow Interrupt Disable */
#define RTC_MODE0_INTENCLR_OVF            ( 0x1u << RTC_MODE0_INTENCLR_OVF_Pos )
#define RTC_MODE0_INTENCLR_MASK           0xC1u  /**< \brief (RTC_MODE0_INTENCLR) MASK Register */

/* -------- RTC_MODE1_INTENCLR : (RTC Offset: 0x06) (R/W  8) MODE1 MODE1 Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CMP : 2;     /*!< bit:  0.. 1  Comparator Interrupt Disables      */
            uint8_t  : 4;        /*!< bit:  2.. 5  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      6  Synchronization Ready Interrupt Disable */
            uint8_t OVF : 1;     /*!< bit:      7  Overflow Interrupt Disable         */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } RTC_MODE1_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE1_INTENCLR_OFFSET         0x06   /**< \brief (RTC_MODE1_INTENCLR offset) MODE1 Interrupt Enable Clear Register */
#define RTC_MODE1_INTENCLR_RESETVALUE     0x00   /**< \brief (RTC_MODE1_INTENCLR reset_value) MODE1 Interrupt Enable Clear Register */

#define RTC_MODE1_INTENCLR_CMP_Pos        0      /**< \brief (RTC_MODE1_INTENCLR) Comparator Interrupt Disables */
#define RTC_MODE1_INTENCLR_CMP_Msk        ( 0x3u << RTC_MODE1_INTENCLR_CMP_Pos )
#define RTC_MODE1_INTENCLR_CMP( value )    ( ( RTC_MODE1_INTENCLR_CMP_Msk & ( ( value ) << RTC_MODE1_INTENCLR_CMP_Pos ) ) )
#define RTC_MODE1_INTENCLR_SYNCRDY_Pos    6      /**< \brief (RTC_MODE1_INTENCLR) Synchronization Ready Interrupt Disable */
#define RTC_MODE1_INTENCLR_SYNCRDY        ( 0x1u << RTC_MODE1_INTENCLR_SYNCRDY_Pos )
#define RTC_MODE1_INTENCLR_OVF_Pos        7      /**< \brief (RTC_MODE1_INTENCLR) Overflow Interrupt Disable */
#define RTC_MODE1_INTENCLR_OVF            ( 0x1u << RTC_MODE1_INTENCLR_OVF_Pos )
#define RTC_MODE1_INTENCLR_MASK           0xC3u  /**< \brief (RTC_MODE1_INTENCLR) MASK Register */

/* -------- RTC_MODE2_INTENCLR : (RTC Offset: 0x06) (R/W  8) MODE2 MODE2 Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t ALARM : 1;   /*!< bit:      0  Alarm Interrupt Disables           */
            uint8_t  : 5;        /*!< bit:  1.. 5  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      6  Synchronization Ready Interrupt Disable */
            uint8_t OVF : 1;     /*!< bit:      7  Overflow Interrupt Disable         */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } RTC_MODE2_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE2_INTENCLR_OFFSET         0x06   /**< \brief (RTC_MODE2_INTENCLR offset) MODE2 Interrupt Enable Clear Register */
#define RTC_MODE2_INTENCLR_RESETVALUE     0x00   /**< \brief (RTC_MODE2_INTENCLR reset_value) MODE2 Interrupt Enable Clear Register */

#define RTC_MODE2_INTENCLR_ALARM_Pos      0      /**< \brief (RTC_MODE2_INTENCLR) Alarm Interrupt Disables */
#define RTC_MODE2_INTENCLR_ALARM_Msk      ( 0x1u << RTC_MODE2_INTENCLR_ALARM_Pos )
#define RTC_MODE2_INTENCLR_ALARM( value )    ( ( RTC_MODE2_INTENCLR_ALARM_Msk & ( ( value ) << RTC_MODE2_INTENCLR_ALARM_Pos ) ) )
#define RTC_MODE2_INTENCLR_SYNCRDY_Pos    6      /**< \brief (RTC_MODE2_INTENCLR) Synchronization Ready Interrupt Disable */
#define RTC_MODE2_INTENCLR_SYNCRDY        ( 0x1u << RTC_MODE2_INTENCLR_SYNCRDY_Pos )
#define RTC_MODE2_INTENCLR_OVF_Pos        7      /**< \brief (RTC_MODE2_INTENCLR) Overflow Interrupt Disable */
#define RTC_MODE2_INTENCLR_OVF            ( 0x1u << RTC_MODE2_INTENCLR_OVF_Pos )
#define RTC_MODE2_INTENCLR_MASK           0xC1u  /**< \brief (RTC_MODE2_INTENCLR) MASK Register */

/* -------- RTC_MODE0_INTENSET : (RTC Offset: 0x07) (R/W  8) MODE0 MODE0 Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CMP : 1;     /*!< bit:      0  Comparator Interrupt Enables       */
            uint8_t  : 5;        /*!< bit:  1.. 5  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      6  Synchronization Ready Interrupt Enable */
            uint8_t OVF : 1;     /*!< bit:      7  Overflow Interrupt Enable          */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } RTC_MODE0_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE0_INTENSET_OFFSET         0x07   /**< \brief (RTC_MODE0_INTENSET offset) MODE0 Interrupt Enable Set Register */
#define RTC_MODE0_INTENSET_RESETVALUE     0x00   /**< \brief (RTC_MODE0_INTENSET reset_value) MODE0 Interrupt Enable Set Register */

#define RTC_MODE0_INTENSET_CMP_Pos        0      /**< \brief (RTC_MODE0_INTENSET) Comparator Interrupt Enables */
#define RTC_MODE0_INTENSET_CMP_Msk        ( 0x1u << RTC_MODE0_INTENSET_CMP_Pos )
#define RTC_MODE0_INTENSET_CMP( value )    ( ( RTC_MODE0_INTENSET_CMP_Msk & ( ( value ) << RTC_MODE0_INTENSET_CMP_Pos ) ) )
#define RTC_MODE0_INTENSET_SYNCRDY_Pos    6      /**< \brief (RTC_MODE0_INTENSET) Synchronization Ready Interrupt Enable */
#define RTC_MODE0_INTENSET_SYNCRDY        ( 0x1u << RTC_MODE0_INTENSET_SYNCRDY_Pos )
#define RTC_MODE0_INTENSET_OVF_Pos        7      /**< \brief (RTC_MODE0_INTENSET) Overflow Interrupt Enable */
#define RTC_MODE0_INTENSET_OVF            ( 0x1u << RTC_MODE0_INTENSET_OVF_Pos )
#define RTC_MODE0_INTENSET_MASK           0xC1u  /**< \brief (RTC_MODE0_INTENSET) MASK Register */

/* -------- RTC_MODE1_INTENSET : (RTC Offset: 0x07) (R/W  8) MODE1 MODE1 Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CMP : 2;     /*!< bit:  0.. 1  Comparator Interrupt Enables       */
            uint8_t  : 4;        /*!< bit:  2.. 5  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      6  Synchronization Ready Interrupt Enable */
            uint8_t OVF : 1;     /*!< bit:      7  Overflow Interrupt Enable          */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } RTC_MODE1_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE1_INTENSET_OFFSET         0x07   /**< \brief (RTC_MODE1_INTENSET offset) MODE1 Interrupt Enable Set Register */
#define RTC_MODE1_INTENSET_RESETVALUE     0x00   /**< \brief (RTC_MODE1_INTENSET reset_value) MODE1 Interrupt Enable Set Register */

#define RTC_MODE1_INTENSET_CMP_Pos        0      /**< \brief (RTC_MODE1_INTENSET) Comparator Interrupt Enables */
#define RTC_MODE1_INTENSET_CMP_Msk        ( 0x3u << RTC_MODE1_INTENSET_CMP_Pos )
#define RTC_MODE1_INTENSET_CMP( value )    ( ( RTC_MODE1_INTENSET_CMP_Msk & ( ( value ) << RTC_MODE1_INTENSET_CMP_Pos ) ) )
#define RTC_MODE1_INTENSET_SYNCRDY_Pos    6      /**< \brief (RTC_MODE1_INTENSET) Synchronization Ready Interrupt Enable */
#define RTC_MODE1_INTENSET_SYNCRDY        ( 0x1u << RTC_MODE1_INTENSET_SYNCRDY_Pos )
#define RTC_MODE1_INTENSET_OVF_Pos        7      /**< \brief (RTC_MODE1_INTENSET) Overflow Interrupt Enable */
#define RTC_MODE1_INTENSET_OVF            ( 0x1u << RTC_MODE1_INTENSET_OVF_Pos )
#define RTC_MODE1_INTENSET_MASK           0xC3u  /**< \brief (RTC_MODE1_INTENSET) MASK Register */

