FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_rtc.h
/* -------- RTC_MODE2_INTENSET : (RTC Offset: 0x07) (R/W  8) MODE2 MODE2 Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t ALARM : 1;   /*!< bit:      0  Alarm Interrupt Enables            */
            uint8_t  : 5;        /*!< bit:  1.. 5  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      6  Synchronization Ready Interrupt Enable */
            uint8_t OVF : 1;     /*!< bit:      7  Overflow Interrupt Enable          */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } RTC_MODE2_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE2_INTENSET_OFFSET         0x07   /**< \brief (RTC_MODE2_INTENSET offset) MODE2 Interrupt Enable Set Register */
#define RTC_MODE2_INTENSET_RESETVALUE     0x00   /**< \brief (RTC_MODE2_INTENSET reset_value) MODE2 Interrupt Enable Set Register */

#define RTC_MODE2_INTENSET_ALARM_Pos      0      /**< \brief (RTC_MODE2_INTENSET) Alarm Interrupt Enables */
#define RTC_MODE2_INTENSET_ALARM_Msk      ( 0x1u << RTC_MODE2_INTENSET_ALARM_Pos )
#define RTC_MODE2_INTENSET_ALARM( value )    ( ( RTC_MODE2_INTENSET_ALARM_Msk & ( ( value ) << RTC_MODE2_INTENSET_ALARM_Pos ) ) )
#define RTC_MODE2_INTENSET_SYNCRDY_Pos    6      /**< \brief (RTC_MODE2_INTENSET) Synchronization Ready Interrupt Enable */
#define RTC_MODE2_INTENSET_SYNCRDY        ( 0x1u << RTC_MODE2_INTENSET_SYNCRDY_Pos )
#define RTC_MODE2_INTENSET_OVF_Pos        7      /**< \brief (RTC_MODE2_INTENSET) Overflow Interrupt Enable */
#define RTC_MODE2_INTENSET_OVF            ( 0x1u << RTC_MODE2_INTENSET_OVF_Pos )
#define RTC_MODE2_INTENSET_MASK           0xC1u  /**< \brief (RTC_MODE2_INTENSET) MASK Register */

/* -------- RTC_MODE0_INTFLAG : (RTC Offset: 0x08) (R/W  8) MODE0 MODE0 Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CMP : 1;     /*!< bit:      0  Comparator Interrupt Flags         */
            uint8_t  : 5;        /*!< bit:  1.. 5  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      6  Synchronization Ready Interrupt Flag */
            uint8_t OVF : 1;     /*!< bit:      7  Overflow Interrupt Flag            */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } RTC_MODE0_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE0_INTFLAG_OFFSET         0x08    /**< \brief (RTC_MODE0_INTFLAG offset) MODE0 Interrupt Flag Status and Clear Register */
#define RTC_MODE0_INTFLAG_RESETVALUE     0x00    /**< \brief (RTC_MODE0_INTFLAG reset_value) MODE0 Interrupt Flag Status and Clear Register */

#define RTC_MODE0_INTFLAG_CMP_Pos        0       /**< \brief (RTC_MODE0_INTFLAG) Comparator Interrupt Flags */
#define RTC_MODE0_INTFLAG_CMP_Msk        ( 0x1u << RTC_MODE0_INTFLAG_CMP_Pos )
#define RTC_MODE0_INTFLAG_CMP( value )    ( ( RTC_MODE0_INTFLAG_CMP_Msk & ( ( value ) << RTC_MODE0_INTFLAG_CMP_Pos ) ) )
#define RTC_MODE0_INTFLAG_SYNCRDY_Pos    6       /**< \brief (RTC_MODE0_INTFLAG) Synchronization Ready Interrupt Flag */
#define RTC_MODE0_INTFLAG_SYNCRDY        ( 0x1u << RTC_MODE0_INTFLAG_SYNCRDY_Pos )
#define RTC_MODE0_INTFLAG_OVF_Pos        7       /**< \brief (RTC_MODE0_INTFLAG) Overflow Interrupt Flag */
#define RTC_MODE0_INTFLAG_OVF            ( 0x1u << RTC_MODE0_INTFLAG_OVF_Pos )
#define RTC_MODE0_INTFLAG_MASK           0xC1u   /**< \brief (RTC_MODE0_INTFLAG) MASK Register */

/* -------- RTC_MODE1_INTFLAG : (RTC Offset: 0x08) (R/W  8) MODE1 MODE1 Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CMP : 2;     /*!< bit:  0.. 1  Comparator Interrupt Flags         */
            uint8_t  : 4;        /*!< bit:  2.. 5  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      6  Synchronization Ready Interrupt Flag */
            uint8_t OVF : 1;     /*!< bit:      7  Overflow Interrupt Flag            */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } RTC_MODE1_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE1_INTFLAG_OFFSET         0x08    /**< \brief (RTC_MODE1_INTFLAG offset) MODE1 Interrupt Flag Status and Clear Register */
#define RTC_MODE1_INTFLAG_RESETVALUE     0x00    /**< \brief (RTC_MODE1_INTFLAG reset_value) MODE1 Interrupt Flag Status and Clear Register */

#define RTC_MODE1_INTFLAG_CMP_Pos        0       /**< \brief (RTC_MODE1_INTFLAG) Comparator Interrupt Flags */
#define RTC_MODE1_INTFLAG_CMP_Msk        ( 0x3u << RTC_MODE1_INTFLAG_CMP_Pos )
#define RTC_MODE1_INTFLAG_CMP( value )    ( ( RTC_MODE1_INTFLAG_CMP_Msk & ( ( value ) << RTC_MODE1_INTFLAG_CMP_Pos ) ) )
#define RTC_MODE1_INTFLAG_SYNCRDY_Pos    6       /**< \brief (RTC_MODE1_INTFLAG) Synchronization Ready Interrupt Flag */
#define RTC_MODE1_INTFLAG_SYNCRDY        ( 0x1u << RTC_MODE1_INTFLAG_SYNCRDY_Pos )
#define RTC_MODE1_INTFLAG_OVF_Pos        7       /**< \brief (RTC_MODE1_INTFLAG) Overflow Interrupt Flag */
#define RTC_MODE1_INTFLAG_OVF            ( 0x1u << RTC_MODE1_INTFLAG_OVF_Pos )
#define RTC_MODE1_INTFLAG_MASK           0xC3u   /**< \brief (RTC_MODE1_INTFLAG) MASK Register */

/* -------- RTC_MODE2_INTFLAG : (RTC Offset: 0x08) (R/W  8) MODE2 MODE2 Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t ALARM : 1;   /*!< bit:      0  Alarm Interrupt Flags              */
            uint8_t  : 5;        /*!< bit:  1.. 5  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      6  Synchronization Ready Interrupt Flag */
            uint8_t OVF : 1;     /*!< bit:      7  Overflow Interrupt Flag            */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } RTC_MODE2_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE2_INTFLAG_OFFSET         0x08    /**< \brief (RTC_MODE2_INTFLAG offset) MODE2 Interrupt Flag Status and Clear Register */
#define RTC_MODE2_INTFLAG_RESETVALUE     0x00    /**< \brief (RTC_MODE2_INTFLAG reset_value) MODE2 Interrupt Flag Status and Clear Register */

#define RTC_MODE2_INTFLAG_ALARM_Pos      0       /**< \brief (RTC_MODE2_INTFLAG) Alarm Interrupt Flags */
#define RTC_MODE2_INTFLAG_ALARM_Msk      ( 0x1u << RTC_MODE2_INTFLAG_ALARM_Pos )
#define RTC_MODE2_INTFLAG_ALARM( value )    ( ( RTC_MODE2_INTFLAG_ALARM_Msk & ( ( value ) << RTC_MODE2_INTFLAG_ALARM_Pos ) ) )
#define RTC_MODE2_INTFLAG_SYNCRDY_Pos    6       /**< \brief (RTC_MODE2_INTFLAG) Synchronization Ready Interrupt Flag */
#define RTC_MODE2_INTFLAG_SYNCRDY        ( 0x1u << RTC_MODE2_INTFLAG_SYNCRDY_Pos )
#define RTC_MODE2_INTFLAG_OVF_Pos        7       /**< \brief (RTC_MODE2_INTFLAG) Overflow Interrupt Flag */
#define RTC_MODE2_INTFLAG_OVF            ( 0x1u << RTC_MODE2_INTFLAG_OVF_Pos )
#define RTC_MODE2_INTFLAG_MASK           0xC1u   /**< \brief (RTC_MODE2_INTFLAG) MASK Register */

/* -------- RTC_STATUS : (RTC Offset: 0x0A) (R/W  8) Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t  : 7;         /*!< bit:  0.. 6  Reserved                           */
            uint8_t SYNCBUSY : 1; /*!< bit:      7  Synchronization Busy Status        */
        } bit;                    /*!< Structure used for bit  access                  */
        uint8_t reg;              /*!< Type      used for register access              */
    } RTC_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_STATUS_OFFSET          0x0A          /**< \brief (RTC_STATUS offset) Status Register */
#define RTC_STATUS_RESETVALUE      0x00          /**< \brief (RTC_STATUS reset_value) Status Register */

