FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_rtc.h
#define RTC_STATUS_SYNCBUSY_Pos    7             /**< \brief (RTC_STATUS) Synchronization Busy Status */
#define RTC_STATUS_SYNCBUSY        ( 0x1u << RTC_STATUS_SYNCBUSY_Pos )
#define RTC_STATUS_MASK            0x80u         /**< \brief (RTC_STATUS) MASK Register */

/* -------- RTC_DBGCTRL : (RTC Offset: 0x0B) (R/W  8) Debug Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DBGRUN : 1; /*!< bit:      0  Run During Debug                   */
            uint8_t  : 7;       /*!< bit:  1.. 7  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint8_t reg;            /*!< Type      used for register access              */
    } RTC_DBGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_DBGCTRL_OFFSET        0x0B           /**< \brief (RTC_DBGCTRL offset) Debug Register */
#define RTC_DBGCTRL_RESETVALUE    0x00           /**< \brief (RTC_DBGCTRL reset_value) Debug Register */

#define RTC_DBGCTRL_DBGRUN_Pos    0              /**< \brief (RTC_DBGCTRL) Run During Debug */
#define RTC_DBGCTRL_DBGRUN        ( 0x1u << RTC_DBGCTRL_DBGRUN_Pos )
#define RTC_DBGCTRL_MASK          0x01u          /**< \brief (RTC_DBGCTRL) MASK Register */

/* -------- RTC_FREQCORR : (RTC Offset: 0x0C) (R/W  8) Frequency Correction Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t VALUE : 7; /*!< bit:  0.. 6  Correction Value                   */
            uint8_t SIGN : 1;  /*!< bit:      7  Correction Sign                    */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } RTC_FREQCORR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_FREQCORR_OFFSET        0x0C          /**< \brief (RTC_FREQCORR offset) Frequency Correction Register */
#define RTC_FREQCORR_RESETVALUE    0x00          /**< \brief (RTC_FREQCORR reset_value) Frequency Correction Register */

#define RTC_FREQCORR_VALUE_Pos     0             /**< \brief (RTC_FREQCORR) Correction Value */
#define RTC_FREQCORR_VALUE_Msk     ( 0x7Fu << RTC_FREQCORR_VALUE_Pos )
#define RTC_FREQCORR_VALUE( value )    ( ( RTC_FREQCORR_VALUE_Msk & ( ( value ) << RTC_FREQCORR_VALUE_Pos ) ) )
#define RTC_FREQCORR_SIGN_Pos      7             /**< \brief (RTC_FREQCORR) Correction Sign */
#define RTC_FREQCORR_SIGN          ( 0x1u << RTC_FREQCORR_SIGN_Pos )
#define RTC_FREQCORR_MASK          0xFFu         /**< \brief (RTC_FREQCORR) MASK Register */

/* -------- RTC_MODE0_COUNT : (RTC Offset: 0x10) (R/W 32) MODE0 MODE0 Count Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t COUNT : 32; /*!< bit:  0..31  Counter Value                      */
        } bit;                   /*!< Structure used for bit  access                  */
        uint32_t reg;            /*!< Type      used for register access              */
    } RTC_MODE0_COUNT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE0_COUNT_OFFSET        0x10       /**< \brief (RTC_MODE0_COUNT offset) MODE0 Count Register */
#define RTC_MODE0_COUNT_RESETVALUE    0x00000000 /**< \brief (RTC_MODE0_COUNT reset_value) MODE0 Count Register */

#define RTC_MODE0_COUNT_COUNT_Pos     0          /**< \brief (RTC_MODE0_COUNT) Counter Value */
#define RTC_MODE0_COUNT_COUNT_Msk     ( 0xFFFFFFFFu << RTC_MODE0_COUNT_COUNT_Pos )
#define RTC_MODE0_COUNT_COUNT( value )    ( ( RTC_MODE0_COUNT_COUNT_Msk & ( ( value ) << RTC_MODE0_COUNT_COUNT_Pos ) ) )
#define RTC_MODE0_COUNT_MASK          0xFFFFFFFFu /**< \brief (RTC_MODE0_COUNT) MASK Register */

/* -------- RTC_MODE1_COUNT : (RTC Offset: 0x10) (R/W 16) MODE1 MODE1 Count Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t COUNT : 16; /*!< bit:  0..15  Counter Value                      */
        } bit;                   /*!< Structure used for bit  access                  */
        uint16_t reg;            /*!< Type      used for register access              */
    } RTC_MODE1_COUNT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE1_COUNT_OFFSET        0x10       /**< \brief (RTC_MODE1_COUNT offset) MODE1 Count Register */
#define RTC_MODE1_COUNT_RESETVALUE    0x0000     /**< \brief (RTC_MODE1_COUNT reset_value) MODE1 Count Register */

#define RTC_MODE1_COUNT_COUNT_Pos     0          /**< \brief (RTC_MODE1_COUNT) Counter Value */
#define RTC_MODE1_COUNT_COUNT_Msk     ( 0xFFFFu << RTC_MODE1_COUNT_COUNT_Pos )
#define RTC_MODE1_COUNT_COUNT( value )    ( ( RTC_MODE1_COUNT_COUNT_Msk & ( ( value ) << RTC_MODE1_COUNT_COUNT_Pos ) ) )
#define RTC_MODE1_COUNT_MASK          0xFFFFu    /**< \brief (RTC_MODE1_COUNT) MASK Register */

/* -------- RTC_MODE2_CLOCK : (RTC Offset: 0x10) (R/W 32) MODE2 MODE2 Clock Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t SECOND : 6; /*!< bit:  0.. 5  Current Second                     */
            uint32_t MINUTE : 6; /*!< bit:  6..11  Current Minute                     */
            uint32_t HOUR : 5;   /*!< bit: 12..16  Current Hour                       */
            uint32_t DAY : 5;    /*!< bit: 17..21  Current Day                        */
            uint32_t MONTH : 4;  /*!< bit: 22..25  Current Month                      */
            uint32_t YEAR : 6;   /*!< bit: 26..31  Current Year                       */
        } bit;                   /*!< Structure used for bit  access                  */
        uint32_t reg;            /*!< Type      used for register access              */
    } RTC_MODE2_CLOCK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

