FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_rtc.h
#define RTC_MODE2_CLOCK_OFFSET        0x10       /**< \brief (RTC_MODE2_CLOCK offset) MODE2 Clock Register */
#define RTC_MODE2_CLOCK_RESETVALUE    0x00000000 /**< \brief (RTC_MODE2_CLOCK reset_value) MODE2 Clock Register */

#define RTC_MODE2_CLOCK_SECOND_Pos    0          /**< \brief (RTC_MODE2_CLOCK) Current Second */
#define RTC_MODE2_CLOCK_SECOND_Msk    ( 0x3Fu << RTC_MODE2_CLOCK_SECOND_Pos )
#define RTC_MODE2_CLOCK_SECOND( value )    ( ( RTC_MODE2_CLOCK_SECOND_Msk & ( ( value ) << RTC_MODE2_CLOCK_SECOND_Pos ) ) )
#define RTC_MODE2_CLOCK_MINUTE_Pos    6          /**< \brief (RTC_MODE2_CLOCK) Current Minute */
#define RTC_MODE2_CLOCK_MINUTE_Msk    ( 0x3Fu << RTC_MODE2_CLOCK_MINUTE_Pos )
#define RTC_MODE2_CLOCK_MINUTE( value )    ( ( RTC_MODE2_CLOCK_MINUTE_Msk & ( ( value ) << RTC_MODE2_CLOCK_MINUTE_Pos ) ) )
#define RTC_MODE2_CLOCK_HOUR_Pos      12         /**< \brief (RTC_MODE2_CLOCK) Current Hour */
#define RTC_MODE2_CLOCK_HOUR_Msk      ( 0x1Fu << RTC_MODE2_CLOCK_HOUR_Pos )
#define RTC_MODE2_CLOCK_HOUR( value )      ( ( RTC_MODE2_CLOCK_HOUR_Msk & ( ( value ) << RTC_MODE2_CLOCK_HOUR_Pos ) ) )
#define   RTC_MODE2_CLOCK_HOUR_PM     ( 0x10u << 12 ) /**< \brief (RTC_MODE2_CLOCK)  */
#define RTC_MODE2_CLOCK_DAY_Pos       17              /**< \brief (RTC_MODE2_CLOCK) Current Day */
#define RTC_MODE2_CLOCK_DAY_Msk       ( 0x1Fu << RTC_MODE2_CLOCK_DAY_Pos )
#define RTC_MODE2_CLOCK_DAY( value )      ( ( RTC_MODE2_CLOCK_DAY_Msk & ( ( value ) << RTC_MODE2_CLOCK_DAY_Pos ) ) )
#define RTC_MODE2_CLOCK_MONTH_Pos     22         /**< \brief (RTC_MODE2_CLOCK) Current Month */
#define RTC_MODE2_CLOCK_MONTH_Msk     ( 0xFu << RTC_MODE2_CLOCK_MONTH_Pos )
#define RTC_MODE2_CLOCK_MONTH( value )    ( ( RTC_MODE2_CLOCK_MONTH_Msk & ( ( value ) << RTC_MODE2_CLOCK_MONTH_Pos ) ) )
#define RTC_MODE2_CLOCK_YEAR_Pos      26         /**< \brief (RTC_MODE2_CLOCK) Current Year */
#define RTC_MODE2_CLOCK_YEAR_Msk      ( 0x3Fu << RTC_MODE2_CLOCK_YEAR_Pos )
#define RTC_MODE2_CLOCK_YEAR( value )     ( ( RTC_MODE2_CLOCK_YEAR_Msk & ( ( value ) << RTC_MODE2_CLOCK_YEAR_Pos ) ) )
#define RTC_MODE2_CLOCK_MASK          0xFFFFFFFFu /**< \brief (RTC_MODE2_CLOCK) MASK Register */

/* -------- RTC_MODE1_PER : (RTC Offset: 0x14) (R/W 16) MODE1 MODE1 Period Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t PER : 16; /*!< bit:  0..15  Counter Period                     */
        } bit;                 /*!< Structure used for bit  access                  */
        uint16_t reg;          /*!< Type      used for register access              */
    } RTC_MODE1_PER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE1_PER_OFFSET        0x14         /**< \brief (RTC_MODE1_PER offset) MODE1 Period Register */
#define RTC_MODE1_PER_RESETVALUE    0x0000       /**< \brief (RTC_MODE1_PER reset_value) MODE1 Period Register */

#define RTC_MODE1_PER_PER_Pos       0            /**< \brief (RTC_MODE1_PER) Counter Period */
#define RTC_MODE1_PER_PER_Msk       ( 0xFFFFu << RTC_MODE1_PER_PER_Pos )
#define RTC_MODE1_PER_PER( value )    ( ( RTC_MODE1_PER_PER_Msk & ( ( value ) << RTC_MODE1_PER_PER_Pos ) ) )
#define RTC_MODE1_PER_MASK          0xFFFFu      /**< \brief (RTC_MODE1_PER) MASK Register */

/* -------- RTC_MODE0_COMP : (RTC Offset: 0x18) (R/W 32) MODE0 MODE0 Compare Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t COMP : 32; /*!< bit:  0..31  Compare Value                      */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } RTC_MODE0_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE0_COMP_OFFSET        0x18        /**< \brief (RTC_MODE0_COMP offset) MODE0 Compare Register */
#define RTC_MODE0_COMP_RESETVALUE    0x00000000  /**< \brief (RTC_MODE0_COMP reset_value) MODE0 Compare Register */

#define RTC_MODE0_COMP_COMP_Pos      0           /**< \brief (RTC_MODE0_COMP) Compare Value */
#define RTC_MODE0_COMP_COMP_Msk      ( 0xFFFFFFFFu << RTC_MODE0_COMP_COMP_Pos )
#define RTC_MODE0_COMP_COMP( value )    ( ( RTC_MODE0_COMP_COMP_Msk & ( ( value ) << RTC_MODE0_COMP_COMP_Pos ) ) )
#define RTC_MODE0_COMP_MASK          0xFFFFFFFFu /**< \brief (RTC_MODE0_COMP) MASK Register */

/* -------- RTC_MODE1_COMP : (RTC Offset: 0x18) (R/W 16) MODE1 MODE1 Compare Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t COMP : 16; /*!< bit:  0..15  Compare Value                      */
        } bit;                  /*!< Structure used for bit  access                  */
        uint16_t reg;           /*!< Type      used for register access              */
    } RTC_MODE1_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE1_COMP_OFFSET        0x18        /**< \brief (RTC_MODE1_COMP offset) MODE1 Compare Register */
#define RTC_MODE1_COMP_RESETVALUE    0x0000      /**< \brief (RTC_MODE1_COMP reset_value) MODE1 Compare Register */

#define RTC_MODE1_COMP_COMP_Pos      0           /**< \brief (RTC_MODE1_COMP) Compare Value */
#define RTC_MODE1_COMP_COMP_Msk      ( 0xFFFFu << RTC_MODE1_COMP_COMP_Pos )
#define RTC_MODE1_COMP_COMP( value )    ( ( RTC_MODE1_COMP_COMP_Msk & ( ( value ) << RTC_MODE1_COMP_COMP_Pos ) ) )
#define RTC_MODE1_COMP_MASK          0xFFFFu     /**< \brief (RTC_MODE1_COMP) MASK Register */

/* -------- RTC_MODE2_ALARM : (RTC Offset: 0x18) (R/W 32) MODE2 MODE2_ALARM Alarm Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t SECOND : 6; /*!< bit:  0.. 5  Alarm Second                       */
            uint32_t MINUTE : 6; /*!< bit:  6..11  Alarm Minute                       */
            uint32_t HOUR : 5;   /*!< bit: 12..16  Alarm Hour                         */
            uint32_t DAY : 5;    /*!< bit: 17..21  Alarm Day                          */
            uint32_t MONTH : 4;  /*!< bit: 22..25  Alarm Month                        */
            uint32_t YEAR : 6;   /*!< bit: 26..31  Alarm Year                         */
        } bit;                   /*!< Structure used for bit  access                  */
        uint32_t reg;            /*!< Type      used for register access              */
    } RTC_MODE2_ALARM_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE2_ALARM_OFFSET        0x18       /**< \brief (RTC_MODE2_ALARM offset) MODE2_ALARM Alarm Register */
#define RTC_MODE2_ALARM_RESETVALUE    0x00000000 /**< \brief (RTC_MODE2_ALARM reset_value) MODE2_ALARM Alarm Register */

