FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_rtc.h
#define RTC_MODE2_ALARM_SECOND_Pos    0          /**< \brief (RTC_MODE2_ALARM) Alarm Second */
#define RTC_MODE2_ALARM_SECOND_Msk    ( 0x3Fu << RTC_MODE2_ALARM_SECOND_Pos )
#define RTC_MODE2_ALARM_SECOND( value )    ( ( RTC_MODE2_ALARM_SECOND_Msk & ( ( value ) << RTC_MODE2_ALARM_SECOND_Pos ) ) )
#define RTC_MODE2_ALARM_MINUTE_Pos    6          /**< \brief (RTC_MODE2_ALARM) Alarm Minute */
#define RTC_MODE2_ALARM_MINUTE_Msk    ( 0x3Fu << RTC_MODE2_ALARM_MINUTE_Pos )
#define RTC_MODE2_ALARM_MINUTE( value )    ( ( RTC_MODE2_ALARM_MINUTE_Msk & ( ( value ) << RTC_MODE2_ALARM_MINUTE_Pos ) ) )
#define RTC_MODE2_ALARM_HOUR_Pos      12         /**< \brief (RTC_MODE2_ALARM) Alarm Hour */
#define RTC_MODE2_ALARM_HOUR_Msk      ( 0x1Fu << RTC_MODE2_ALARM_HOUR_Pos )
#define RTC_MODE2_ALARM_HOUR( value )      ( ( RTC_MODE2_ALARM_HOUR_Msk & ( ( value ) << RTC_MODE2_ALARM_HOUR_Pos ) ) )
#define RTC_MODE2_ALARM_DAY_Pos       17         /**< \brief (RTC_MODE2_ALARM) Alarm Day */
#define RTC_MODE2_ALARM_DAY_Msk       ( 0x1Fu << RTC_MODE2_ALARM_DAY_Pos )
#define RTC_MODE2_ALARM_DAY( value )       ( ( RTC_MODE2_ALARM_DAY_Msk & ( ( value ) << RTC_MODE2_ALARM_DAY_Pos ) ) )
#define RTC_MODE2_ALARM_MONTH_Pos     22         /**< \brief (RTC_MODE2_ALARM) Alarm Month */
#define RTC_MODE2_ALARM_MONTH_Msk     ( 0xFu << RTC_MODE2_ALARM_MONTH_Pos )
#define RTC_MODE2_ALARM_MONTH( value )     ( ( RTC_MODE2_ALARM_MONTH_Msk & ( ( value ) << RTC_MODE2_ALARM_MONTH_Pos ) ) )
#define RTC_MODE2_ALARM_YEAR_Pos      26         /**< \brief (RTC_MODE2_ALARM) Alarm Year */
#define RTC_MODE2_ALARM_YEAR_Msk      ( 0x3Fu << RTC_MODE2_ALARM_YEAR_Pos )
#define RTC_MODE2_ALARM_YEAR( value )      ( ( RTC_MODE2_ALARM_YEAR_Msk & ( ( value ) << RTC_MODE2_ALARM_YEAR_Pos ) ) )
#define RTC_MODE2_ALARM_MASK          0xFFFFFFFFu /**< \brief (RTC_MODE2_ALARM) MASK Register */

/* -------- RTC_MODE2_MASK : (RTC Offset: 0x1C) (R/W  8) MODE2 MODE2_ALARM Alarm Mask Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t SEL : 3;   /*!< bit:  0.. 2  Alarm Mask Selection               */
            uint8_t  : 5;      /*!< bit:  3.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } RTC_MODE2_MASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE2_MASK_OFFSET                0x1C /**< \brief (RTC_MODE2_MASK offset) MODE2_ALARM Alarm Mask Register */
#define RTC_MODE2_MASK_RESETVALUE            0x00 /**< \brief (RTC_MODE2_MASK reset_value) MODE2_ALARM Alarm Mask Register */

#define RTC_MODE2_MASK_SEL_Pos               0    /**< \brief (RTC_MODE2_MASK) Alarm Mask Selection */
#define RTC_MODE2_MASK_SEL_Msk               ( 0x7u << RTC_MODE2_MASK_SEL_Pos )
#define RTC_MODE2_MASK_SEL( value )    ( ( RTC_MODE2_MASK_SEL_Msk & ( ( value ) << RTC_MODE2_MASK_SEL_Pos ) ) )
#define   RTC_MODE2_MASK_SEL_OFF             ( 0x0u << 0 ) /**< \brief (RTC_MODE2_MASK)  */
#define   RTC_MODE2_MASK_SEL_SS              ( 0x1u << 0 ) /**< \brief (RTC_MODE2_MASK)  */
#define   RTC_MODE2_MASK_SEL_MMSS            ( 0x2u << 0 ) /**< \brief (RTC_MODE2_MASK)  */
#define   RTC_MODE2_MASK_SEL_HHMMSS          ( 0x3u << 0 ) /**< \brief (RTC_MODE2_MASK)  */
#define   RTC_MODE2_MASK_SEL_DDHHMMSS        ( 0x4u << 0 ) /**< \brief (RTC_MODE2_MASK)  */
#define   RTC_MODE2_MASK_SEL_MMDDHHMMSS      ( 0x5u << 0 ) /**< \brief (RTC_MODE2_MASK)  */
#define   RTC_MODE2_MASK_SEL_YYMMDDHHMMSS    ( 0x6u << 0 ) /**< \brief (RTC_MODE2_MASK)  */
#define RTC_MODE2_MASK_MASK                  0x07u         /**< \brief (RTC_MODE2_MASK) MASK Register */

/** \brief RtcMode2Alarm hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct
    {
        __IO RTC_MODE2_ALARM_Type ALARM;      /**< \brief Offset: 0x00 (R/W 32) MODE2_ALARM Alarm Register */
        __IO RTC_MODE2_MASK_Type MASK;        /**< \brief Offset: 0x04 (R/W  8) MODE2_ALARM Alarm Mask Register */
        RoReg8 Reserved1[ 0x3 ];
    } RtcMode2Alarm;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief RTC_MODE0 hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct                             /* 32-bit Counter with Single 32-bit Compare */
    {
        __IO RTC_MODE0_CTRL_Type CTRL;         /**< \brief Offset: 0x00 (R/W 16) MODE0 Control Register */
        __IO RTC_READREQ_Type READREQ;         /**< \brief Offset: 0x02 (R/W 16) Read Request Register */
        __IO RTC_MODE0_EVCTRL_Type EVCTRL;     /**< \brief Offset: 0x04 (R/W 16) MODE0 Event Control Register */
        __IO RTC_MODE0_INTENCLR_Type INTENCLR; /**< \brief Offset: 0x06 (R/W  8) MODE0 Interrupt Enable Clear Register */
        __IO RTC_MODE0_INTENSET_Type INTENSET; /**< \brief Offset: 0x07 (R/W  8) MODE0 Interrupt Enable Set Register */
        __IO RTC_MODE0_INTFLAG_Type INTFLAG;   /**< \brief Offset: 0x08 (R/W  8) MODE0 Interrupt Flag Status and Clear Register */
        RoReg8 Reserved1[ 0x1 ];
        __IO RTC_STATUS_Type STATUS;           /**< \brief Offset: 0x0A (R/W  8) Status Register */
        __IO RTC_DBGCTRL_Type DBGCTRL;         /**< \brief Offset: 0x0B (R/W  8) Debug Register */
        __IO RTC_FREQCORR_Type FREQCORR;       /**< \brief Offset: 0x0C (R/W  8) Frequency Correction Register */
        RoReg8 Reserved2[ 0x3 ];
        __IO RTC_MODE0_COUNT_Type COUNT;       /**< \brief Offset: 0x10 (R/W 32) MODE0 Count Register */
        RoReg8 Reserved3[ 0x4 ];
        __IO RTC_MODE0_COMP_Type COMP[ 1 ];    /**< \brief Offset: 0x18 (R/W 32) MODE0 Compare Register [NUM_OF_COMP32] */
    } RtcMode0;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief RTC_MODE1 hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct                             /* 16-bit Counter with Two 16-bit Compares */
    {
        __IO RTC_MODE1_CTRL_Type CTRL;         /**< \brief Offset: 0x00 (R/W 16) MODE1 Control Register */
        __IO RTC_READREQ_Type READREQ;         /**< \brief Offset: 0x02 (R/W 16) Read Request Register */
        __IO RTC_MODE1_EVCTRL_Type EVCTRL;     /**< \brief Offset: 0x04 (R/W 16) MODE1 Event Control Register */
        __IO RTC_MODE1_INTENCLR_Type INTENCLR; /**< \brief Offset: 0x06 (R/W  8) MODE1 Interrupt Enable Clear Register */
        __IO RTC_MODE1_INTENSET_Type INTENSET; /**< \brief Offset: 0x07 (R/W  8) MODE1 Interrupt Enable Set Register */
        __IO RTC_MODE1_INTFLAG_Type INTFLAG;   /**< \brief Offset: 0x08 (R/W  8) MODE1 Interrupt Flag Status and Clear Register */
        RoReg8 Reserved1[ 0x1 ];
        __IO RTC_STATUS_Type STATUS;           /**< \brief Offset: 0x0A (R/W  8) Status Register */
        __IO RTC_DBGCTRL_Type DBGCTRL;         /**< \brief Offset: 0x0B (R/W  8) Debug Register */
        __IO RTC_FREQCORR_Type FREQCORR;       /**< \brief Offset: 0x0C (R/W  8) Frequency Correction Register */
        RoReg8 Reserved2[ 0x3 ];
        __IO RTC_MODE1_COUNT_Type COUNT;       /**< \brief Offset: 0x10 (R/W 16) MODE1 Count Register */
        RoReg8 Reserved3[ 0x2 ];
        __IO RTC_MODE1_PER_Type PER;           /**< \brief Offset: 0x14 (R/W 16) MODE1 Period Register */
        RoReg8 Reserved4[ 0x2 ];
        __IO RTC_MODE1_COMP_Type COMP[ 2 ];    /**< \brief Offset: 0x18 (R/W 16) MODE1 Compare Register [NUM_OF_COMP16] */
    } RtcMode1;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief RTC_MODE2 hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct                             /* Clock/Calendar with Alarm */
    {
        __IO RTC_MODE2_CTRL_Type CTRL;         /**< \brief Offset: 0x00 (R/W 16) MODE2 Control Register */
        __IO RTC_READREQ_Type READREQ;         /**< \brief Offset: 0x02 (R/W 16) Read Request Register */
        __IO RTC_MODE2_EVCTRL_Type EVCTRL;     /**< \brief Offset: 0x04 (R/W 16) MODE2 Event Control Register */
        __IO RTC_MODE2_INTENCLR_Type INTENCLR; /**< \brief Offset: 0x06 (R/W  8) MODE2 Interrupt Enable Clear Register */
        __IO RTC_MODE2_INTENSET_Type INTENSET; /**< \brief Offset: 0x07 (R/W  8) MODE2 Interrupt Enable Set Register */
        __IO RTC_MODE2_INTFLAG_Type INTFLAG;   /**< \brief Offset: 0x08 (R/W  8) MODE2 Interrupt Flag Status and Clear Register */
        RoReg8 Reserved1[ 0x1 ];
        __IO RTC_STATUS_Type STATUS;           /**< \brief Offset: 0x0A (R/W  8) Status Register */
        __IO RTC_DBGCTRL_Type DBGCTRL;         /**< \brief Offset: 0x0B (R/W  8) Debug Register */
        __IO RTC_FREQCORR_Type FREQCORR;       /**< \brief Offset: 0x0C (R/W  8) Frequency Correction Register */
        RoReg8 Reserved2[ 0x3 ];
        __IO RTC_MODE2_CLOCK_Type CLOCK;       /**< \brief Offset: 0x10 (R/W 32) MODE2 Clock Register */
        RoReg8 Reserved3[ 0x4 ];
        RtcMode2Alarm Mode2Alarm[ 1 ];         /**< \brief Offset: 0x18 RtcMode2Alarm groups [NUM_OF_ALARMS] */
    } RtcMode2;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        RtcMode0 MODE0;                       /**< \brief Offset: 0x00 32-bit Counter with Single 32-bit Compare */
        RtcMode1 MODE1;                       /**< \brief Offset: 0x00 16-bit Counter with Two 16-bit Compares */
        RtcMode2 MODE2;                       /**< \brief Offset: 0x00 Clock/Calendar with Alarm */
    } Rtc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_RTC_COMPONENT_ */
